alexdoubin/Hello-Wolrd/hh.ioc
#MicroXplorer Configuration settings - do not modify
CAD.formats=
CAD.pinconfig=
CAD.provider=
Dma.Request0=TIM7_UP
Dma.RequestsNb=1
Dma.TIM7_UP.0.Direction=DMA_PERIPH_TO_MEMORY
Dma.TIM7_UP.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.TIM7_UP.0.Instance=DMA1_Stream4
Dma.TIM7_UP.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
Dma.TIM7_UP.0.MemInc=DMA_MINC_ENABLE
Dma.TIM7_UP.0.Mode=DMA_NORMAL
Dma.TIM7_UP.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
Dma.TIM7_UP.0.PeriphInc=DMA_PINC_DISABLE
Dma.TIM7_UP.0.Priority=DMA_PRIORITY_LOW
Dma.TIM7_UP.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
File.Version=6
GPIO.groupedBy=
KeepUserPlacement=false
Mcu.CPN=STM32F429AGH6
Mcu.Family=STM32F4
Mcu.IP0=DCMI
Mcu.IP1=DMA
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP4=SYS
Mcu.IP5=TIM7
Mcu.IP6=TIM8
Mcu.IPNb=7
Mcu.Name=STM32F429A(G-I)Hx
Mcu.Package=UFBGA169
Mcu.Pin0=PI6
Mcu.Pin1=PI5
Mcu.Pin10=PH14
Mcu.Pin11=PA9
Mcu.Pin12=PA10
Mcu.Pin13=PG6
Mcu.Pin14=PF10
Mcu.Pin15=PH8
Mcu.Pin16=PH7
Mcu.Pin17=PA6
Mcu.Pin18=VP_SYS_VS_Systick
Mcu.Pin19=VP_TIM7_VS_ClockSourceINT
Mcu.Pin2=PE1
Mcu.Pin20=VP_TIM8_VS_ClockSourceINT
Mcu.Pin3=PI7
Mcu.Pin4=PI4
Mcu.Pin5=PE0
Mcu.Pin6=PD6
Mcu.Pin7=PI0
Mcu.Pin8=PE4
Mcu.Pin9=PI1
Mcu.PinsNb=21
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32F429AGHx
MxCube.Version=6.9.2
MxDb.Version=DB.6.0.92
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DMA1_Stream4_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.TIM7_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA10.Mode=Slave_14_bits_External_Synchro
PA10.Signal=DCMI_D1
PA6.Mode=Slave_14_bits_External_Synchro
PA6.Signal=DCMI_PIXCLK
PA9.Mode=Slave_14_bits_External_Synchro
PA9.Signal=DCMI_D0
PD6.Mode=Slave_14_bits_External_Synchro
PD6.Signal=DCMI_D10
PE0.Mode=Slave_14_bits_External_Synchro
PE0.Signal=DCMI_D2
PE1.Mode=Slave_14_bits_External_Synchro
PE1.Signal=DCMI_D3
PE4.Mode=Slave_14_bits_External_Synchro
PE4.Signal=DCMI_D4
PF10.Mode=Slave_14_bits_External_Synchro
PF10.Signal=DCMI_D11
PG6.Mode=Slave_14_bits_External_Synchro
PG6.Signal=DCMI_D12
PH14.Mode=Output Compare2 CH2N
PH14.Signal=TIM8_CH2N
PH7.Mode=Slave_14_bits_External_Synchro
PH7.Signal=DCMI_D9
PH8.Mode=Slave_14_bits_External_Synchro
PH8.Signal=DCMI_HSYNC
PI0.Locked=true
PI0.Mode=Slave_14_bits_External_Synchro
PI0.Signal=DCMI_D13
PI1.Mode=Slave_14_bits_External_Synchro
PI1.Signal=DCMI_D8
PI4.Mode=Slave_14_bits_External_Synchro
PI4.Signal=DCMI_D5
PI5.Mode=Slave_14_bits_External_Synchro
PI5.Signal=DCMI_VSYNC
PI6.Mode=Slave_14_bits_External_Synchro
PI6.Signal=DCMI_D6
PI7.Mode=Slave_14_bits_External_Synchro
PI7.Signal=DCMI_D7
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F429AGHx
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.27.1
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=0
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=hh.ioc
ProjectManager.ProjectName=hh
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=EWARM V8.50
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_DMA_Init-DMA-false-HAL-true,3-MX_GPIO_Init-GPIO-false-HAL-true,4-MX_TIM7_Init-TIM7-false-HAL-true,5-MX_DCMI_Init-DCMI-false-HAL-true,6-MX_TIM8_Init-TIM8-false-HAL-true
RCC.AHBFreq_Value=16000000
RCC.APB1Freq_Value=16000000
RCC.APB2Freq_Value=16000000
RCC.CortexFreq_Value=16000000
RCC.FamilyName=M
RCC.HSE_VALUE=25000000
RCC.HSI_VALUE=16000000
RCC.I2SClocksFreq_Value=96000000
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB2Freq_Value,CortexFreq_Value,FamilyName,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,PLLCLKFreq_Value,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VCOSAIOutputFreq_ValueR,VcooutputI2S,VcooutputI2SQ
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.PLLCLKFreq_Value=96000000
RCC.PLLQCLKFreq_Value=48000000
RCC.RTCFreq_Value=32000
RCC.RTCHSEDivFreq_Value=12500000
RCC.SYSCLKFreq_VALUE=16000000
RCC.VCOI2SOutputFreq_Value=192000000
RCC.VCOInputFreq_Value=1000000
RCC.VCOOutputFreq_Value=192000000
RCC.VCOSAIOutputFreq_Value=49000000
RCC.VCOSAIOutputFreq_ValueQ=12250000
RCC.VCOSAIOutputFreq_ValueR=24500000
RCC.VcooutputI2S=96000000
RCC.VcooutputI2SQ=96000000
TIM7.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM7.IPParameters=Prescaler,AutoReloadPreload
TIM7.Prescaler=1
TIM8.Channel-Output\ Compare2\ CH2N=TIM_CHANNEL_2
TIM8.IPParameters=Channel-Output Compare2 CH2N
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM7_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM7_VS_ClockSourceINT.Signal=TIM7_VS_ClockSourceINT
VP_TIM8_VS_ClockSourceINT.Mode=Internal
VP_TIM8_VS_ClockSourceINT.Signal=TIM8_VS_ClockSourceINT
board=custom
